{
  "title1": "关于社区",
  "title2": "主要项目",
  "title3": "历史沿革",
  "subheading1": "安同 OS",
  "subheading2": "星霞 OS",
  "subheading3": "小熊猫包管理",
  "subheading4": "libLoL",
  "subheading5": "Ciel",
  "subheading6": "Autobuild4",
  "p1": "安同开源社区（Anthon Open Source Community，简称 AOSC）成立于 2011 年末，是一个由计算机爱好者志愿组织工作，主要活动于线上的开源社区。我社的主要工作目标分为技术、文化和社会三个方面。",
  "p2": "技术方面，社区的主要项目为安同 OS（英译：AOSCOS），是一款以“简明可靠”为设计及维护目标的 Linux 发行版。安同 OS 主要面向有一定 Linux 使用经验的用户，针对个人桌面设备优化体验，致力于为用户提供开箱即用、系统管理简洁和可靠的工作环境。在维护安同 OS 的同时，我们亦通过开发小熊猫包管理 (oma) 、libLoL 龙架构新旧世界兼容层等周边软件项目，进一步提升系统的使用体验。作为一个贡献者主要为汉语母语用户的社区，我们也通过包括字体搭配及渲染调优、直接参与上游软件本地化工作和软件选择等手段，改善简中环境的使用体验。",
  "p3": "文化方面，我社命名“安同”，本意“安于同学合作”。安：我社致力于树立和维护以人为本的核心文化，在推进日常工作的同时，不忘维系社区贡献者和成员之间的良好人际关系 —— 在我社，我们先是朋友，才是同事。同：技术的积累源自于实践，而技术的发展离不开共享和传授 —— 不论新老，相互学习方才是进步之道。安于同学合作，才不至于孤立无缘，故步自封。",
  "p4": "社会方面，我社重视围绕开源软件生态协作共进及技能共享。作为一个成员成分丰富的社区，我们自 2011 年成立起便以不同方式参与社会工作，协同各地区 Linux 爱好者、校园社团和企业单位宣扬开源软件的广泛应用。自 2015 年起，社区每年暑期均会举办名为 AOSCC 的年度聚会，邀请包括社区贡献者、成员、校园社团、企业和个人参与，在向外界宣传社区工作的同时，为爱好者和行业代表提供了分享技术技巧和行业知识及动向的平台。近年来，我社每年还以导师身份安排贡献者参与国内外的开源项目推进活动，如中国科学院软件研究所的“开源之夏”活动，带领国内外高校学生锻炼应用和研发能力、积累专业经验。",
  "p5": "我社主要项目围绕 AOSC OS 和 Afterglow 两大系统项目设计开发，亦有维护一系列周边应用和实用工具，以及各类开发维护用工具。",
  "p6": "安同 OS（英译：AOSC OS）是一款以“简明可靠”为设计及维护目标的 Linux 发行版。本系统主要面向有一定 Linux 使用经验的用户，针对个人桌面设备优化体验，致力于为用户提供开箱即用和简便可靠的工作环境。",
  "p7": "AOSC OS 支持众多处理器架构，包括 x86_64、AArch64、基于 MIPS 的龙芯 3 和龙架构（LoongArch 新世界），以及如 RISC-V 等新兴架构；在提供架构支持的同时，我们也有针对不同设备类型进行体验测试和调优，致力于在各种不同架构和类型的设备上实现开箱即用的体验。",
  "p8": "星霞 OS（英译：Afterglow）基于安同 OS 开发，通过精简特性、配置调优和软件精选等手段，致力于为各类老旧设备提供持续软件和技术更新，通过持续维护良好体验和性能让老旧设备焕发新生、让用户们“重拾旧爱”。",
  "p9": "小熊猫包管理 (oma，全称 oh-my-ailurus) 是一款注重操作简化、可靠性和使用效率的软件包管理前端。该包管理前端在操作和功能上兼容 APT，并基于这一基础引入历史查阅、操作撤销、文件检索等功能。",
  "p10": "libLoL (LoongArch on LoongArch) 旧世界 ABI 常用于为龙芯官方的 Loongnix 参考发行和统信 UOS 设计的商业软件，如腾讯 QQ、金山 WPS for Linux 和龙芯浏览器等。由于这些应用程序尚未移植到新世界 ABI 上，本运行时旨在为新世界发行版用户提供运行上述应用程序的便利。",
  "p11": "Ciel 是一款容器化软件包构建环境管理工具，用于标准化软件包构建环境，以保障特性均等和内容可靠。",
  "p12": "Autobuild4 是一款半自动软件包构建工具，可根据定义文件和脚本等自动下载、构建和生成软件包，亦支持利用构建和命令模板简化构建脚本编写流程。",
  "p13": "安同开源社区 (AOSC) 的最初形态是由白铭骢与他的两位同学于 2011 年末创立的安同开发团队 (Anthon.Dev)。开发团队因组织管理不善于一年内夭折，而后于 2012 年末重组为开源社区并延续至今。",
  "p14": "我社主要项目安同 OS 最初名为“AnthonOS”，是一款基于现已弃用的 SUSE Studio 制作的 openSUSE 衍生发行版。一年后转而基于 Debian 衍生开发，着重于 CJK（中文、日文及韩文）支持并基于 KDE 4 设计了一套定制用户界面。2014 年，得益于原东方之心 Linux 开发者 Icenowy Zheng 的帮助，社区以 Anthon :Next 为名立项，将安同 OS 转为独立构建。安同 OS 独立后更名为 AOSC OS，即我社目前维护的通用 Linux 发行版。随后几年，维护者们不断扩充 AOSC OS 的软件源体积，并引入了多架构支持。如今，得力于开发者们的持续贡献，AOSC OS 的软硬件支持仍在不断扩充壮大，并围绕其发起了众多支持性项目。",
  "p15": "我社的年度聚会 AOSCC 始于 2014 年的暑期贡献者聚会，后于 2015 年开始组织暑期线下聚会，在各企业和院校社团赞助的场地举办。每年聚会均邀请开源软件业界相关人士参与和分享经验，免费开放给各地社区好友参与。"
}
