{
  "title1": "About the Community",
  "title2": "Main Projects",
  "title3": "History",
  "subheading1": "Anthon OS",
  "subheading2": "Afterglow OS",
  "subheading3": "Ailurus Package Management",
  "subheading4": "libLoL",
  "subheading5": "Ciel",
  "subheading6": "Autobuild4",
  "p1": "The Anthon Open Source Community (AOSC) was established in late 2011. It is an open-source community primarily active online, organized by computer enthusiasts and volunteers. The main objectives of the community are divided into three areas: technology, culture, and society.",
  "p2": "In terms of technology, the main project of the community is Anthon OS (translated: AOSCOS), a Linux distribution with a design and maintenance goal of 'simplicity and reliability.' Anthon OS primarily targets users with some experience in Linux, optimizing the user experience for personal desktop devices, and is dedicated to providing users with an out-of-the-box, easy-to-manage, and reliable work environment. In addition to maintaining Anthon OS, we also develop peripheral software projects, such as Ailurus Package Management (oma) and the libLoL compatibility layer for the LoongArch architecture, to further enhance the system's user experience. As a community primarily contributing to Chinese-speaking users, we also improve the Simplified Chinese environment through font pairing and rendering optimization, direct participation in upstream software localization work, and software selection.",
  "p3": "In terms of culture, our community is named 'Anthon,' which means 'Content with cooperative study.' Anthon: Our community is committed to building and maintaining a people-centered core culture. While advancing daily work, we also focus on maintaining good interpersonal relationships between contributors and members — here, we are friends first, colleagues second. Cooperation: The accumulation of technology comes from practice, and technological development relies on sharing and teaching — whether new or old, mutual learning is the path to progress. Content with cooperative study ensures that we do not become isolated or stagnant.",
  "p4": "In terms of society, our community values collaboration within the open-source software ecosystem and skill sharing. As a community with a diverse membership, we have been involved in social work in various ways since our establishment in 2011, collaborating with Linux enthusiasts, campus organizations, and businesses to promote the widespread use of open-source software. Since 2015, the community has hosted an annual event named AOSCC every summer, inviting contributors, members, campus organizations, businesses, and individuals to participate. This event promotes the community's work while providing a platform for enthusiasts and industry representatives to share technical skills, industry knowledge, and trends. In recent years, we have also participated as mentors in domestic and international open-source project activities, such as the 'Summer of Open Source' program at the Institute of Software, Chinese Academy of Sciences, where we help students from universities both in China and abroad improve their application and development skills and gain professional experience.",
  "p5": "Our main projects focus on the design and development of the AOSC OS and Afterglow system projects. We also maintain a series of peripheral applications, practical tools, and various development and maintenance tools.",
  "p6": "Anthon OS (translated: AOSC OS) is a Linux distribution designed with 'simplicity and reliability' as its primary goals. The system is primarily aimed at users with some experience in Linux, optimizing the user experience for personal desktop devices, and providing an out-of-the-box, easy-to-manage, and reliable work environment.",
  "p7": "AOSC OS supports a wide range of processor architectures, including x86_64, AArch64, MIPS-based Loongson 3 and LoongArch (LoongArch New World), and emerging architectures such as RISC-V. While providing architecture support, we also conduct experience testing and optimization for different device types, striving to provide an out-of-the-box experience on various architectures and device types.",
  "p8": "Afterglow OS (translated: Afterglow) is developed based on Anthon OS. By simplifying features, tuning configurations, and selecting software, it aims to provide continuous software and technology updates for older devices, revitalizing them and allowing users to 'rediscover old favorites' with a refreshed experience and performance.",
  "p9": "Ailurus Package Management (oma, short for oh-my-ailurus) is a package management frontend focused on simplifying operations, reliability, and efficiency. This frontend is compatible with APT in terms of operations and functionality and introduces features such as history tracking, operation undo, and file search.",
  "p10": "libLoL (LoongArch on LoongArch) is an ABI commonly used to run commercial software designed for the official Loongnix reference distribution and UOS, such as Tencent QQ, Kingsoft WPS for Linux, and the Loongson Browser. As these applications have not yet been ported to the New World ABI, this runtime aims to provide convenience for users of New World distributions to run these applications.",
  "p11": "Ciel is a containerized software package build environment management tool used to standardize the software package build environment, ensuring consistent features and reliable content.",
  "p12": "Autobuild4 is a semi-automatic package build tool that can automatically download, build, and generate packages based on definition files and scripts. It also supports simplifying the build script writing process through build and command templates.",
  "p13": "The Anthon Open Source Community (AOSC) originated as the Anthon Development Team (Anthon.Dev), founded by Bai Mingcong and two of his classmates in late 2011. The development team folded within a year due to poor organizational management, but was reorganized into the open-source community at the end of 2012, continuing to the present.",
  "p14": "Our main project, Anthon OS, was initially named 'AnthonOS,' a derivative distribution of openSUSE created using the now-deprecated SUSE Studio. A year later, it switched to being based on Debian, focusing on CJK (Chinese, Japanese, and Korean) support and designed a custom user interface based on KDE 4. In 2014, with the help of former Dongfang Zhi Xin Linux developer Icenowy Zheng, the community initiated the Anthon:Next project and began building Anthon OS as an independent distribution. After becoming independent, Anthon OS was renamed AOSC OS, the general-purpose Linux distribution that the community maintains today. In the following years, maintainers expanded the software repository and introduced multi-architecture support. Thanks to the continuous contributions of developers, the software and hardware support of AOSC OS continues to grow, and numerous supporting projects have been initiated around it.",
  "p15": "Our annual event AOSCC began as a summer contributor gathering in 2014 and evolved into an annual offline gathering starting in 2015, held at venues sponsored by various businesses and academic organizations. Each year, the event invites industry professionals from the open-source software sector to share their experiences, and is open to community friends from various regions to participate for free."
}
