{
  "title1": "About the Community",
  "title2": "Main projects",
  "title3": "History",
  "subheading1": "Antong OS",
  "subheading2": "Afterglow OS",
  "subheading3": "Little Panda Package Management",
  "subheading4": "libLoL",
  "subheading5": "Ciel",
  "subheading6": "Autobuild4",
  "p1": "Anthon Open Source Community (AOSC) was established in the late 2011. It is an open source community that is volunteered by computer enthusiasts and mainly operates online. The main work goals of our club are divided into three aspects: technology, culture and society.",
  "p2": "In terms of technology, the main project of the community is Antong OS, a Linux distribution with \"concise and reliable\" as its design and maintenance goal. Antong OS is mainly aimed at users with certain Linux usage experience, optimizes the experience for personal desktop devices, and is committed to providing users with a working environment that is out of the box, simple and reliable system management. While maintaining Antong OS, we also further improve the system's user experience by developing peripheral software projects such as Panda Package Management (oma), libLoL Dragon Architecture New and Old World Compatibility Layer. As a community where contributors are mainly native Chinese speakers, we also improve the user experience of the Simplified Environment by including font matching and rendering and tuning, directly participating in upstream software localization work and software selection.",
  "p3": "In terms of culture, our club named \"Antong\", which originally means \"be content with classmates' cooperation\". An: Our club is committed to establishing and maintaining a core culture of people-orientedness. While promoting daily work, we do not forget to maintain good interpersonal relationships between community contributors and members. In our club, we are friends first and colleagues. Same: The accumulation of technology comes from practice, while the development of technology cannot be separated from sharing and teaching - no matter old or new, learning from each other is the way to progress. Only by being content with your classmates’ cooperation will you avoid being isolated and being self-consistent.",
  "p4": "In terms of society, our club attaches importance to collaboration and skill sharing around open source software ecosystems. As a community with rich membership, we have participated in social work in different ways since its establishment in 2011, collaborating with Linux enthusiasts, campus communities and corporate organizations in various regions to promote the widespread use of open source software. Since 2015, the community will hold an annual gathering called AOSCC every summer, inviting community contributors, members, campus clubs, businesses and individuals to participate. While promoting community work to the outside world, it provides enthusiasts and industry representatives with a platform to share technical skills, industry knowledge and trends. In recent years, our club has also arranged contributors to participate in domestic and foreign open source project promotion activities as a tutor every year, such as the \"Open Source Summer\" activity of the Institute of Software, Chinese Academy of Sciences, leading students at home and abroad to exercise their application and R&D capabilities and accumulate professional experience.",
  "p5": "Our main projects are designed and developed around the two major system projects, AOSC OS and Afterglow, and also have a series of peripheral applications and practical tools, as well as various development and maintenance tools.",
  "p6": "Antong OS (English translation: AOSC OS) is a Linux distribution with \"concise and reliable\" as its design and maintenance goal. This system is mainly aimed at users with certain Linux usage experience, optimizes the experience for personal desktop devices, and is committed to providing users with an out-of-the-box and a simple and reliable working environment.",
  "p7": "AOSC OS supports a variety of processor architectures, including x86_64, AArch64, MIPS-based LoongArch 3 and LoongArch architectures (New World), as well as emerging architectures such as RISC-V; while providing architecture support, we also have experience testing and tuning for different device types, committed to achieving an out-of-the-box experience on a variety of different architectures and types of devices.",
  "p8": "Afterglow OS  is developed based on Antong OS. Through streamlining features, configuration tuning and software selection, it is committed to providing continuous software and technology updates for various old devices. Through continuous maintenance of good experience and performance, old devices are reborn and users \"regain their old love\".",
  "p9": "Panda Package Management (oma, full name oh-my-ailurus) is a software package management front-end that focuses on operation simplification, reliability and usage efficiency. The package management front-end is operationally and functionally compatible with APT, and based on this basis, it introduces functions such as history review, operation revocation, and file retrieval.",
  "p10": "libLoL (LoongArch on LoongArch) Old World ABI is often used for commercial software designed for Loongnix official Loongnix reference distribution and Tongxin UOS, such as Tencent QQ, Kingsoft WPS for Linux and Loongson Browser. Since these applications have not been ported to the New World ABI, this runtime is intended to provide users with the convenience of running the above applications.",
  "p11": "Ciel is a containerized package building environment management tool for standardizing package building environments to ensure equal features and reliable content.",
  "p12": "Autobuild4 is a semi-automatic package building tool that automatically downloads, builds and generates software packages based on definition files and scripts, and also supports the use of build and command templates to simplify the build scripting process.",
  "p13": "The initial form of Antong Open Source Community (AOSC) was founded by Bai Mingcong and two of his classmates in late 2011. The development team died within one year due to poor organizational management, and then reorganized into an open source community at the end of 2012 and continued to this day.",
  "p14": "Our main project, Antong OS, was originally named \"AnthonOS\", and is an openSUSE derivative distribution based on the now deprecated SUSE Studio. A year later, it turned to Debian-derived development, focusing on CJK (Chinese, Japanese and Korean) support and designed a customized user interface based on KDE 4. In 2014, thanks to the help of Icenowy Zheng, the former Linux developer of Oriental Heart, the community launched a project under the name of Anthon :Next and converted Antong OS into an independent construction. After Antong OS became independent, it was renamed AOSC OS, which is the general Linux distribution currently maintained by our company. In the following years, maintainers continued to expand the software source volume of AOSC OS and introduced multi-architecture support. Today, thanks to the continuous contribution of developers, the software and hardware support of AOSC OS is still expanding and expanding, and many supportive projects have been launched around it.",
  "p15": "Our company’s annual gathering, AOSCC, started with the summer contributor gathering in 2014, and then organized offline summer gatherings in 2015, held in venues sponsored by various enterprises and colleges and universities. Every year, relevant people in the open source software industry are invited to participate and share their experiences, and are free to friends from all over the world to participate."
}
