{
  "index": {
    "title1": "Xingxia OS",
    "title2": "System Features",
    "subheading1": "Adapt to local conditions",
    "subheading2": "Continuous maintenance",
    "subheading3": "For the future",
    "p1": "Xingxia OS (English translation: Afterglow) is developed based on Antong OS. Through streamlining features, configuration tuning and software selection, it is committed to providing continuous software and technology updates for various old devices. Through continuous maintenance of good experience and performance, old devices are reborn and users \"regain their old love\".",
    "p2": "Xingxia OS supports devices that are nearly thirty years old, such as PCs equipped with 486 processors and Macintosh computers with m68k processors, and also supports newer devices, such as Macs equipped with Intel Atom netbooks or PowerPC processors around 2010. Through configuration tuning and feature grading, Xingxia OS can ensure a good user experience on all kinds of old devices.",
    "p3": "The basic premise for allowing old devices to continue to shine and heat is continuous and complete software support. Xingxia OS provides continuous feature updates and security vulnerability repairs, allowing you to continue to use old devices in various scenarios with confidence.",
    "p4": "We plan to continue to maintain Xingxia OS in the coming years and release update packages periodically so that you can continue to enjoy and play with the computers that have brought you happiness and carved your memories in the early years with peace of mind."
  },
  "isa": {
    "title1": "Xingxia OS architecture support specification table",
    "p1": "Xingxia OS supports multiple processor architectures. This table introduces the supported various processor architectures and corresponding micro-architecture instruction set extension support, software package architecture name, compiler target name and other information.",
    "p2": "*: This architecture port only supports Loongson 2F processor, not 2E and previous processor models",
    "p3": "**: This architecture port only supports 68020 and newer processor models with memory management unit (MMU)",
    "table1": {
      "caption": "List of processor architectures supported by Xingxia OS",
      "th": [
        "Processor architecture name",
        "Microarchitecture instruction set extension support requirements",
        "Package architecture name",
        "Compiler target name"
      ],
      "tr": [
        [
          ["Alpha", "none"],
          ["alpha", "alpha-aosc-linux-gnu"]
        ],
        [
          ["ARMv4", "none"],
          ["armv4", "arm-aosc-linux-gnueabi"]
        ],
        [
          ["ARMv6 (hard floating point)", "Thumb-2, NEON"],
          ["armv6hf", "arm-aosc-linux-gnueabihf"]
        ],
        [
          ["ARMv7 (hard floating point)", "Thumb-2, NEON"],
          ["armv7hf", "arm-aosc-linux-gnueabihf"]
        ],
        [
          ["MIPS-based Loongson 2 processor *", "LoongMMI"],
          ["loongson2f", "mips64el-aosc-linux-gnuabi64"]
        ],
        [
          ["Intel 80486 or updated", "none"],
          ["i486", "i486-aosc-linux-gnu"]
        ],
        [
          ["Motorola 68000 Series Processor **", "none"],
          ["m68k", "m68k-aosc-linux-gnu"]
        ],
        [
          ["PowerPC (32-bit, big-endian)", "none"],
          ["powerpc", "powerpc-aosc-linux-gnu"]
        ],
        [
          ["PowerPC (64-bit, big-endian)", "AltiVec"],
          ["ppc64", "powerpc64-aosc-linux-gnu"]
        ],
        [
          ["SPARC (64-bit)", "SPARC V9, VIS 1.0"],
          ["sparc64", "sparc64-aosc-linux-gnu"]
        ]
      ]
    }
  },
  "requirements": {
    "title1": "Xingxia OS system configuration requirements table",
    "title2": "Additional Instructions",
    "p1": "Xingxia OS is an operating system for old devices and limited functions. Pre-installed software and basic management features have certain requirements for device processors, graphics cards, storage and Internet connections. Based on our tests, we summarized the following system configuration requirements table based on the basic benchmark of good user experience.",
    "table1": {
      "caption": "Xingxia OS system configuration requirements table",
      "th": ["Hardware components", "Configuration requirements"],
      "tr": [
        ["processor", "Any processor compatible with Xingxia OS"],
        ["Memory", "At least 64MiB"],
        [
          "Graphics Card",
          "Any graphics card or frame buffer card that supports display signal output, or serial port terminal"
        ],
        ["storage", "At least 1GiB (basic version) or 3GiB (desktop version)"],
        ["Network connection", "International Internet connection"]
      ]
    },
    "ul1": {
      "li": [
        "For more information about Xingxia OS-compatible processors, please see",
        "For desktop versions with graphical interfaces, it is necessary to support at least SVGA resolution and color depth (800×600 resolution, 16-bit color depth / 65535 colors)",
        "The suggestions for storage requirements are based on the fact that there is enough space for daily work and system update settings after the system is installed; if your device has large memory, the size of the default swap space (virtual memory file) created by the installer will also become larger, so you should also make relevant considerations when partitioning."
      ]
    }
  }
}
